[
    {
        "title": "Ilm-e Tibb Ki Dilchasp Hikayat",
        "urdu": "علم ے طب کی دلچسپ حکایت",
        "waqia": "Hazrat e Ali bin Hussain bin wakid عَلَيْهِ رَحْمَةُ اللهِ الْوَاحِد se ek nasrani(Christain/Eshayi) doctor ne kaha: Ytumhare deen mein 'Ilm-e tibb' bilkul nahi lihaza tumhara deen nakis hai. Unho ne jawab dia: Hamare pyare pyare Allah(عَزَّ وَجَلَّ) ne saara ka saara Ilm-e tibb Quran-e paak ki is aadhi ayat:  كُلُوْاوَاشْرَبُوْاوَلَاتُسْرِفُوْا (Tarjuma e Kanjul Imaan: Khao aur pio aur had se na baro. پارہ ۸ سورة الاعراف ۳۱) mei bayan farma dia hai. \n\tWo doctor bola: tumhare nabi ne bhi kya kahin ilm-e tibb ka tazkira kia hai?\n\tFarmaya: Tabibon ke tabib Allah(عَزَّ وَجَلَّ) ke habib, hibibe labib(صلى الله عليه و سلم) ne chand lafzon mein sara tibb jam'a farma dia hai. Irshad farmaya hai: 'Me'da sari bimarion ka ghar aur parhez sari ilajon ka sar hai, badan ke har hisse ko uss ka haq do'\n\tYeh sun kar nasrani doctor hairan ho kar kahne lagaL waqei Quran aur tumhare Rasul ne jalinus(Jo ki dunia ka bahut bada tabib gujra hai) ke lie tibb ka koi mas'ala chodha hi nahin, sab kuch bayan kar dia.",
        "hawala": "Tafseer e Nayimee, Parah: 8, S. 393"
    },
    {
        "title": "Ghibat zina se bhi badtar hai.",
        "urdu": "غیبت جنا سے بھی بدتر",
        "waqia": "Rasool e Maqbul(ﷺ) irshaad farmate hain ki apne aap ko ghibat se bachao, yeh zinaa se jyada buri hai. Pucha gaya yeh zina se kaise badtar hai? To aapne farmaya, aadmi zinaa kar ke tauba kar leta hai to Allah(عزوجل) ta’ala uss ki tauba qabul farmata hai. Magar ghibat karne wale jab tak woh shakhs jis ki ghibat ki gayi ho, maaf na kare uski tauba qabool nahi hoti. Lihaza har ghibat karne wale ke lie jaruri hai ki wo Allah(عزوجل) ke huzur sharminda hokar tauba kare taaki Allah ke karam se kamyaab ho kar fir uss shakhs se maafi mange jis ki uss ne ghibat ki thi, taaki ghibat ke andhiaron se rihai hasil ho.\n\nFarmane nabawi hai ki jo apne musalmaan bhai ki ghibat karta hai, Allah ta’ala qiyamat ke din uss ka munh piche ki taraf fer dega, iss lie har ghibat karne wale par lazim hai ki woh jis shakhs ki ghibat ki uss tak baat pauchne se pahle hi ruzuw karle. Kiunki ghibat ke wahan tak pauchne se pahle jis ki ghibat ki gayi ho, agar tauba karli jaye to tauba qabool ho jati hai. Magar jab baat uss shakhs tak pauch jae to jab tak woh khud maaf na kare, tauba se gunah maaf nahi hota aur isi tarah shaadi-shuda aurat se zina ka masla hai. Jab tak uska sohor maaf na karde, tauba qabool nahi hogi. \n\n Raha Namaaz, Roja, Hajj aur Zakaat ka muamla to qaza, ada kie bagair in ki tauba bhi qabool nahi hogi.",
        "hawala": "Mukashfatul Qulub"
    },
    {
        "title": "Do Waqion ki Khidmat",
        "urdu": "دو واقیون کی کھدمت",
        "waqia": "Ek Shaksh en ek ghulam kharida, ghulam ne kaha ye malik! Meri tin shartein hai-\n\t\t\t1.  Jab naamz ka waqat aye to mujhe uss ke ada karne se na rokna. -\n\t\t\t2.  Din ko mujh se jo chaho kaam lo magar raat ko nahi. -\n\t\t\t3. Mujhe aisa kamra do jis me mere siwa koi na aye. -\n\nMalik ne tinon sharten manzur karte hue kaha ghar me rahne ke lie koi kamra pasand kar lo. Ghulam ne kharab sa kamra pasand kar lia. Malik bola tune kharab kamra kiun pasand kia? Ghulam ne jawab dia ye maalik! Yah kharab kamra Allah(عزوجل) ke yahan chaman hai. Chunanche yeh din ko malik ki khidmat karta aur raat ko Allah(عزوجل) ki ibaadat me mashghul rahta. Ek raat us ka malik wahan se guzra to us ne dekha kamra raushan hai, ghulam sajda me hai aur uss ke sar par nurani kindil(lalten) latki hai aur woh aah wo zari karte hue kah raha hai, ya ilahi! Tu ne mujh par malik ki khidmat wajib kar di hai aur mujh par ye zimmedari na hoti to mai subah wo sham teri ibaadat me mashghul rahta., ye Allah(عزوجل) mera uzr qabool farma le. Malik sari raat us ki ibadat dekhta raha yehan tak ki subah ho gayi. Kindil bujh gai aur kamre ki chhat pahle ki tarah barabar ho gayi. Wah wapas lauta aur apni biwi ko sari mazra kah sunaya.\n\n\n Jab dusri raat ho gayi wo apni biwi ko saath lekar wohan pahuch gaya, wohan dekha to ghulam sajda me tha raushan kindil raushan thi, woh dono darwaje par khade ho gaye saari raat use dekh kar rote rahe, jab subah sui to unhone ghulam ko bulakar kaha- hum ne tume Allah(عزوجل) ka naam par azad kar dia hai taaki tu faraagat se uski ibadat kar sake. Ghulam ne apne haat aasman ki taraf uthaye aur kaha-\n\t\t ye sahibe raaz. Raaz zahir ho gaya, abb mei iss raaz ke khulne aur shuhrat ke baad zindagi nahi chahta. Fir kaha ye ilahi! Mujhe de de aur gir kar mar gaya. Haqiqat me nek, aashiq aur maula ke chahne wale logon ke halaat yeise hi hote hai.",
        "hawala": "Mukashfatul Qulub"
    }
]